import { Avatar, Box, List, ListItem, Typography } from "@mui/material";
import BreadCrumb from "../../components/ui/Breadcrumb/BreadCrumb";
import { flexCol, sectionTitle } from "../../styles/globalStyles";
import {
  detailContainer,
  mentorInfoBox,
  roadMapDetailImg,
  roadmapDetailText,
  selectedText,
} from "./roadmapStyle";
import VideoPlayer from "../../components/ui/Videoplayer/VideoPlayer";
import videoSrc from "../../assets/video/roadmap.mp4";
import { mentor_2, pic_1, pic_2, pic_3, pic_4 } from "../../data/imgSource";

const items = [
  { title: "مسیر های یادگیری", link: "/roadmap" },
  { title: "مسیر یادگیری برنامه نویسی" },
];

function RoadmapDetail() {
  return (
    <>
      <Box sx={{ ...flexCol(5), mt: 4, mb: 6 }}>
        <BreadCrumb items={items} />
        <Box sx={detailContainer}>
          <Box sx={flexCol(4)}>
            <VideoPlayer videoSrc={videoSrc} />
            <Typography sx={sectionTitle}>مسیر یادگیری برنامه نویسی</Typography>
            <Box sx={mentorInfoBox}>
              <Avatar
                src={mentor_2}
                alt="تصویر مدرس دوره"
                sx={{ width: "44px", height: "44px" }}
              />
              <Typography
                sx={{
                  color: "primary.main",
                  fontWeight: 700,
                  fontSize: "18px",
                }}
              >
                میلاد ده یامی
              </Typography>
            </Box>
          </Box>
          <Box sx={flexCol(4)}>
            <Typography sx={roadmapDetailText}>
              اگر شما هم علاقه‌مند به آشنایی با مسیر یادگیری برنامه‌نویسی هستید
              بدون شک این موضوع را شنیده‌اید که برنامه‌نویسی یک شغل بسیار
              پول‌ساز است که می‌تواند درآمد بالایی را برای شما به همراه داشته
              باشد. از طرفی دیگر برخی از افراد نیز هستند که پس از ورود به این
              حوزه و عدم موفقیت در آن شروع به بدگویی درباره این فیلد می‌کنند و
              احتمالا شما هم شنیده‌اید که برخی از افراد می‌گویند که برنامه‌نویسی
              در ایران نمی‌تواند رشته چندان جذابی باشد و درآمد بالایی نیز ندارد.
              دلیل این موضوع این است که افراد اطلاعاتی درباره چارچوب کلی{"  "}
              <Typography component={"span"} sx={{ color: "primary.main" }}>
                یادگیری برنامه‌نویسی
              </Typography>
              {"  "}
              ندارند و همین عامل نیز باعث می‌شود تا نتوانند در این زمینه موفق
              شده و درآمد بالایی داشته باشند. در خصوص این موضوع چند سوال بسیار
              مهم وجود دارد که در ادامه درباره برخی از آنها صحبت خواهیم کرد.
            </Typography>
            <Box>
              <Box
                component="img"
                alt="سوالات رایج"
                src={pic_1}
                sx={roadMapDetailImg}
                loading="lazy"
              />
            </Box>
            <Box>
              <Typography sx={{ ...sectionTitle, mb: 2 }}>
                سوالات رایج در حوزه برنامه‌نویسی
              </Typography>
              <Typography sx={roadmapDetailText}>
                پیش از صحبت درباره مسیر یادگیری برنامه‌نویسی اجازه دهید تا برخی
                از سوالات رایج موجود در این حوزه را مطرح کنیم. از جمله این
                سوالات می‌توان به موارد زیر اشاره کرد:
              </Typography>
              <List
                disablePadding
                sx={{
                  "& .MuiListItem-root": {
                    p: 0,
                    my: 2,
                  },
                  pr: 5,
                }}
              >
                <ListItem>
                  آیا برای یادگیری آن نیازمند دانش زبان انگلیسی هستیم؟
                </ListItem>
                <ListItem>
                  آیا دانش ریاضی ما باید در سطح بالایی قرار داشته باشد؟
                </ListItem>
                <ListItem>سن ما برای یادگرفتن برنامه‌نویسی بالا نیست؟</ListItem>
              </List>
              <Typography sx={roadmapDetailText}>
                برای یادگرفتن برنامه‌نویسی شما نیازی به مدرک زبان ندارید و با یک
                دانش کاملا ابتدایی می‌توانید خیلی سریع به مباحث مربوط به حوزه
                برنامه‌نویسی مسلط شوید. به‌طورکلی ما یک زبان تخصصی و یک زبان
                عمومی داریم. دانش زبان عمومی می‌تواند بسیار مفید باشد ولی چیزی
                که ما در برنامه‌نویسی به آن نیاز داریم زبان تخصصی است. در واقع
                شما باید کم‌کم در طول مسیر یادگرفتن برنامه‌نویسی می‌تواند به
                دانش زبان تخصصی و آشنایی با اصطلاحات حوزه برنامه‌نویسی نیز دست
                پیدا کنید.
              </Typography>
              <Typography sx={roadmapDetailText}>
                مسئله دوم دانش ریاضی در حوزه برنامه‌نویسی است. اگر شما قصد داشته
                باشید در یک پروژه مسائل مربوط به ریاضی را به کار ببرید باید
                بدانید که پیش‌ازاین کتابخانه‌هایی نوشته شده‌اند که به‌صورت آماده
                در اختیار شما قرار می‌گیرند و می‌توانید از آنها برای محاسبات
                ریاضی استفاده کنید. پس شما برای شروع برنامه‌نویسی نیازی به دانش
                ریاضی ندارید، البته اگر قصد داشته باشید که در برخی از حوزه‌های
                خاص مانند{" "}
                <Typography component="span" sx={selectedText}>
                  هوش مصنوعی و یادگیری ماشین فعالیت کنید باید دانش ریاضی نیز
                  داشته باشید.
                </Typography>{" "}
              </Typography>
              <Typography sx={roadmapDetailText}>
                مسئله سوم یعنی سن نیز هیچ‌گونه تاثیری در مسیر یادگیری شما نخواهد
                داشت.
              </Typography>
            </Box>
            <Box>
              <Box
                component="img"
                alt="یک نکته مهم"
                src={pic_2}
                sx={roadMapDetailImg}
              />
            </Box>
            <Box>
              <Typography sx={{ ...sectionTitle, mb: 2 }}>
                یک نکته کلیدی و مهم برای یادگیری برنامه‌نویسی
              </Typography>
              <Typography sx={roadmapDetailText}>
                در خصوص مسیر یادگیری برنامه‌نویسی باید به این نکته دقت داشته
                باشید که یادگیری برنامه‌نویسی کار ساده‌ای نیست. البته تمامی
                افراد که از نظر بهره هوشی در سطح نرمال جامعه هستند می‌توانند
                یادگیری آن را آغاز کنند و موفق شوند به شرطی که هر روز تمرین
                کنند. شما باید به‌ عنوان یک برنامه‌نویس{" "}
                <Typography component="span" sx={selectedText}>
                  هر روز در حال آموزش و یادگیری باشید
                </Typography>
                . بزرگ‌ترین چالش شما در این مسیر صرف زمان زیاد برای یادگیری است.
                بسیاری از افراد صبر و حوصله کافی برای تمرین هرروزه ندارند و به
                همین علت نیز برنامه‌نویس موفقی نمی‌شوند. چالش دوم مشکلاتی است که
                در انجام پروژه‌ها ممکن است برای شما به وجود بیاید. گاهی اوقات
                برای برطرف‌کردن یک مشکل کوچک باید زمان زیادی را صرف پروژه خود
                کنید. پس باید برای این مسیر سخت آماده باشید.
              </Typography>
            </Box>
            <Typography sx={roadmapDetailText}>
              نکته دیگری که باید درباره نقشه راه یادگیری برنامه‌نویسی بدانید این
              است که پس از یادگیری یک زبان برنامه‌نویسی را به طور کامل آموختید و
              آماده ورود به بازار کار شدید سه گزینه پیش روی شما خواهد بود. این
              سه گزینه به ترتیب استخدام شدن و تبدیل‌شدن به یک کارمند، فعالیت
              به‌صورت فریلنسری و راه‌اندازی استارت‌آپ هستند. کارمند شدن در یک
              شرکت برای شروع کار می‌تواند بسیار مناسب باشد و به شما کمک کند تا
              با چرخه و سازوکار راه‌اندازی یک پروژه و تعریف آن آشنا شوید.
              بااین‌حال نباید فراموش کنید که با کارمند شدن نمی‌توانید به درآمد
              فوق‌العاده‌ای که در برنامه‌نویسی از آن صحبت می‌شود دست پیدا کنید.
            </Typography>
            <Typography sx={roadmapDetailText}>
              کارمند باهوش کارمندی است که در کنار{" "}
              <Typography sx={selectedText} component="span">
                شغل اصلی خود به‌صورت فریلنسری نیز فعالیت می‌کند
              </Typography>
              . منظور از مهارت فریلنسری این است که شما یک‌سری از مهارت‌های نرم
              مانند پرزنت خود، ارتباط با دیگران، بازاریابی و ... را نیز باید
              بهبود دهید تا بتوانید پروژه بگیرید؛ بنابراین اگر با این مهارت‌های
              نرم آشنا نباشید نمی‌توانید در ابتدای کار پروژه دریافت کرده و به
              درآمد برسید.
            </Typography>
            <Box>
              <Box
                component="img"
                alt="فری لنسری"
                src={pic_3}
                sx={roadMapDetailImg}
              />
            </Box>
            <Box>
              <Typography sx={{ ...sectionTitle, mb: 2 }}>
                نکته‌ای درباره فریلنسر بودن
              </Typography>
              <Typography sx={roadmapDetailText}>
                برای تبدیل‌شدن{" "}
                <Typography sx={selectedText} component="span">
                  به یک فریلنسر شما باید تعهد شخصی فوق‌العاده‌ای داشته باشید
                </Typography>
                . در واقع شما باید زمان‌بندی‌های پروژه را انجام دهید و به‌طورکلی
                مدیر برنامه خودتان خواهید بود. یکی از مشکلاتی که در ابتدای مسیر
                فریلنسری ممکن است درگیر آن شوید عقب و جلو شدن تاریخ تحویل
                پروژه‌ها است. با وجود این‌که مسیر فریلنسر بودن بسیار پرچالش است
                ولی مطمئن باشید که کاملا ارزشمند خواهد بود و می‌تواند شما را به
                درآمدهای فوق‌العاده‌ای که در ذهن دارید برساند.
              </Typography>
            </Box>
            <Box>
              <Box
                component="img"
                alt="فری لنسری"
                src={pic_4}
                sx={roadMapDetailImg}
              />
            </Box>
            <Box>
              <Typography sx={{ ...sectionTitle, mb: 2 }}>
                راه‌اندازی استارت‌آپ به‌عنوان یک برنامه‌نویس
              </Typography>
              <Typography sx={roadmapDetailText}>
                سومین راهکار برای کسب درآمد که قصد داریم در مسیر یادگیری
                برنامه‌نویسی درباره آن صحبت کنیم راه‌اندازی یک استارت‌آپ است که
                نیازمند ریسک‌پذیری بالایی می‌باشد. علاوه بر این شما باید قدرت
                مدیریت بالایی نیز داشته باشید تا بتوانید کارمندان خود را مدیریت
                کنید. در کل پیشنهادی که برای شما داریم این است که کار خود را با
                کارمندی شروع کرده و کم‌کم به‌صورت آزاد و فریلنسری کار کنید تا به
                درآمد بالا برسید و در صورت علاقه حتما راه‌اندازی استارت‌آپ را
                نیز امتحان کنید.
              </Typography>
            </Box>
            <Box>
              <Typography sx={{ ...sectionTitle, mb: 2 }}>
                درآمد برنامه نویس
              </Typography>
              <Typography sx={roadmapDetailText}>
                در قسمت پایانی از نقشه راه یادگیری برنامه‌نویسی قصد داریم درباره
                درآمد این حوزه صحبت کنیم. به‌طورکلی درآمد یک مسئله کاملا شخصی
                است یعنی هر شخصی متناسب با توانایی‌ها و مهارت‌هایی که دارد درآمد
                به دست می‌آورد. برخی از افراد توانایی بسیار بالایی در زمینه
                برنامه‌نویسی دارند و می‌توانند کدهای پیچیده را در مدت‌زمان
                کوتاهی بنویسند ولی به علت عدم داشتن مهارت‌های نرم درآمد مناسبی
                ندارد. برخی از افراد نیز تنها ساخت وب‌سایت را به‌خوبی آموخته‌اند
                ولی با بازاریابی مناسب برای آن می‌توانند به درآمد بالایی برسند.
              </Typography>
            </Box>
            <Box>
              <Typography sx={{ ...sectionTitle, mb: 2 }}>
                انتخاب زبان برنامه‌نویسی
              </Typography>
              <Typography sx={roadmapDetailText}>
                انتخاب زبان برنامه‌نویسی کاملا وابسته به نوع کاری است که قصد
                انجام آن را دارید.{" "}
                <Typography sx={selectedText} component="span">
                  به‌عنوان‌مثال برای هوش مصنوعی زبان برنامه‌نویسی پایتون بسیار
                  گزینه جذابی است
                </Typography>
                ، برای طراحی گیم و بازی سی‌شارپ از بهترین گزینه‌ها است و برای
                ساخت ربات زبان‌های سی و سی پلاس پلاس می‌توانند گزینه جذابی
                باشند. اگر قصد دارید تنها برنامه‌نویسی را آغاز کنید و در آینده
                حوزه فعالیت خود را انتخاب کنید سینتکس زبان‌های مختلف را بررسی
                کرده و از میان آنها بهترین گزینه را انتخاب کنید. در انتها حتما
                مسیرهای یادگیری زبان‌ها و پلتفرم‌های مختلف را در سایت کد یاد
                بررسی کنید.
              </Typography>
            </Box>
          </Box>
        </Box>
      </Box>
    </>
  );
}

export default RoadmapDetail;
