import { Box, Divider, Typography } from "@mui/material";
import { flexCol } from "../../styles/globalStyles";
import { aboutusContainer, aboutusImg, aboutusText } from "./aboutusStyle";
import {
  about_1,
  about_2,
  about_3,
  about_4,
  about_5,
} from "../../data/imgSource";
import BlogSlider from "../home/Sections/Blog/BlogSlider";

function Aboutus() {
  return (
    <>
      <Box sx={aboutusContainer}>
        <Box sx={{ ...flexCol(2.5), flex: 1 }}>
          <Typography
            sx={{ fontWeight: 600, fontSize: { xs: "18px", lg: "24px" } }}
          >
            درباره ما
          </Typography>
          <Divider />
          <Box>
            <Box
              component="img"
              alt="بنر درباره ما"
              src={about_1}
              sx={aboutusImg}
            />
          </Box>
          <Typography sx={aboutusText}>
            در دنیای امروز که فناوری‌های نوین به سرعت در حال تغییر و پیشرفت
            هستند، توانایی تسلط بر مهارت‌های برنامه‌نویسی و تکنولوژی‌های دیجیتال
            یکی از مهم‌ترین نیازهای فردی و حرفه‌ای به شمار می‌آید. آکادمی کدینو
            با درک عمیق از این نیازها و با هدف ایجاد بستری برای یادگیری عمیق و
            ترویج آموزش رایگان در ایران، تأسیس شده است تا فضایی را فراهم کند که
            همه افراد علاقه‌مند به دنیای فناوری، بدون توجه به سطح مهارت یا تجربه
            قبلی، بتوانند در آن دانش و توانایی‌های خود را توسعه دهند. در آکادمی
            کدینو بیش از 700 ساعت آموزش رایگان فارسی برنامه نویسی وجود دارد و
            میتواند برای شروع مسیر یادگیری برنامه نویسی بسیار مفید باشد.
          </Typography>
          <Typography sx={aboutusText}>
            آکادمی کدینو با بهره‌گیری از مجرب ترین مدرسین و پشتیبانی حرفه ای،
            محیطی پویا و تعاملی را برای یادگیری آنلاین ارائه می‌دهد. ما بر این
            باور هستیم که یادگیری نباید محدود به چهارچوب‌های سنتی کلاس‌های حضوری
            باشد و هر فرد باید بتواند با توجه به سبک زندگی و نیازهای خود به
            آموزش‌های با کیفیت و روز دنیا دسترسی داشته باشد. به همین دلیل، کدینو
            پلتفرم آنلاینی را فراهم کرده است که علاقه مندان به برنامه نویسی و
            دنیای تکنولوژی و دیجیتال مارکتینگ از هر نقطه جهان به راحتی به آن
            دسترسی دارند و می‌توانند از محتوای آموزشی متنوع ما بهره‌مند شوند.
          </Typography>
          <Box>
            <Box
              component="img"
              alt="بنر درباره ما"
              src={about_2}
              sx={aboutusImg}
            />
          </Box>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            هدف و مأموریت ما
          </Typography>
          <Typography sx={aboutusText}>
            هدف اصلی ما در کدینو، پرورش نسل جدیدی از برنامه‌نویسان و متخصصان
            فناوری است که بتوانند در دنیای پرسرعت و دیجیتال امروزی، حرفی برای
            گفتن داشته باشند. مأموریت ما ارائه آموزش‌هایی است که نه تنها به
            تقویت مهارت‌های تئوری کمک کند، بلکه هنرجویان را به طور عملی برای
            ورود به بازار کار آماده سازد. در این راستا، تمامی دوره‌های آموزشی ما
            به صورت پروژه‌محور طراحی شده‌اند تا فراگیران بتوانند با انجام
            پروژه‌های واقعی، مهارت‌های خود را در عمل به کار بگیرند.
          </Typography>
          <Box>
            <Box
              component="img"
              alt="بنر درباره ما"
              src={about_3}
              sx={aboutusImg}
            />
          </Box>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            رویکرد آموزشی ما
          </Typography>
          <Typography sx={aboutusText}>
            آکادمی کدینو از ابتدا با تمرکز بر ارائه آموزش‌های عملی و کاربردی بنا
            شده است. ما بر این باوریم که یادگیری نباید صرفاً به تئوری محدود شود؛
            بلکه ترکیبی از تئوری و تمرین عملی است که می‌تواند یک یادگیرنده را به
            سطح مطلوبی از مهارت برساند. دوره‌های ما به گونه‌ای طراحی شده‌اند که
            دانشجویان پس از اتمام هر دوره، بتوانند با اعتماد به نفس کافی
            پروژه‌های واقعی را به تنهایی انجام دهند و آن‌ها را در رزومه خود قرار
            دهند.
          </Typography>
          <Typography sx={aboutusText}>
            یکی از ویژگی‌های بارز دوره‌های آموزشی کدینو، پشتیبانی کامل و تعامل
            با اساتید و دیگر فراگیران است. ما از یک رویکرد تعاملی استفاده
            می‌کنیم تا دانشجویان بتوانند در هر مرحله از یادگیری، از پشتیبانی
            کامل بهره‌مند شوند و سوالات و چالش‌های خود را با تیم آموزشی و دیگر
            دانشجویان در میان بگذارند. این رویکرد باعث می‌شود که یادگیری به یک
            تجربه مشارکتی و تعاملی تبدیل شود که در آن هر فرد می‌تواند از تجربیات
            دیگران نیز بهره‌مند شود. برای همین تمام دوره های پولی آکادمی کدینو
            دارای گروه پشتیبانی تلگرام هستند و دانشجویان میتوانند بصورت مستقیم
            با مدرس دوره در ارتباط باشند.
          </Typography>
          <Box>
            <Box
              component="img"
              alt="بنر درباره ما"
              src={about_4}
              sx={aboutusImg}
            />
          </Box>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            تیم آموزشی ما
          </Typography>
          <Typography sx={aboutusText}>
            یکی از نقاط قوت آکادمی کدینو، تیم آموزشی مجرب و متخصص ماست. اساتید
            ما نه تنها از دانش تئوری عمیقی برخوردار هستند، بلکه تجربه عملی و
            حرفه‌ای در زمینه‌های مختلف فناوری اطلاعات و برنامه‌نویسی دارند. این
            ویژگی باعث می‌شود که محتوای آموزشی کدینو به روز، کاربردی و منطبق بر
            نیازهای واقعی صنعت باشد. هر یک از اعضای تیم آموزشی ما با شور و
            اشتیاق به آموزش می‌پردازند و همواره در تلاشند تا بهترین تجربیات خود
            را با دانشجویان به اشتراک بگذارند.
          </Typography>
          <Typography sx={aboutusText}>
            اساتید کدینو در فرآیند آموزشی خود از مثال‌ها و پروژه‌های واقعی
            استفاده می‌کنند تا دانشجویان بتوانند با چالش‌های عملی که در دنیای
            واقعی با آن‌ها مواجه خواهند شد، آشنا شوند. این رویکرد به دانشجویان
            کمک می‌کند تا بهتر بتوانند دانش خود را به کار گیرند و پس از اتمام
            دوره، به سرعت وارد بازار کار شوند.
          </Typography>
          <Box>
            <Box
              component="img"
              alt="بنر درباره ما"
              src={about_5}
              sx={aboutusImg}
            />
          </Box>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            دوره‌های آموزشی ما
          </Typography>
          <Typography sx={aboutusText}>
            در کدینو، ما به ارائه دوره‌های آموزشی در زمینه‌های متنوعی از جمله
            برنامه‌نویسی، توسعه وب، هوش مصنوعی، تحلیل داده، دیجیتال مارکتینگ، و
            بسیاری از حوزه‌های دیگر فناوری می‌پردازیم. دوره‌های ما برای تمامی
            سطوح از مبتدی تا پیشرفته طراحی شده‌اند. بنابراین، چه شما یک فرد
            تازه‌کار باشید که به دنبال یادگیری اولین زبان برنامه‌نویسی خود
            هستید، یا یک توسعه‌دهنده حرفه‌ای که به دنبال ارتقای مهارت‌های خود در
            یک زمینه خاص می‌باشد، در کدینو دوره‌ای مناسب برای شما وجود خواهد
            داشت.
          </Typography>
          <Typography sx={aboutusText}>
            تمامی دوره‌های ما به گونه‌ای طراحی شده‌اند که یادگیرندگان بتوانند با
            سرعت خود پیش بروند و در صورت نیاز به پشتیبانی، از کمک‌های مستمر تیم
            پشتیبانی و اساتید بهره‌مند شوند. همچنین، ما در کدینو بر این باوریم
            که یادگیری هیچ‌گاه نباید متوقف شود، به همین دلیل دوره‌های ما به طور
            مداوم به‌روزرسانی می‌شوند تا همواره با جدیدترین تکنولوژی‌ها و
            استانداردهای روز دنیا همگام باشند.
          </Typography>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            یادگیری انعطاف‌پذیر
          </Typography>
          <Typography sx={aboutusText}>
            یکی از اصول اساسی ما در کدینو، ارائه یادگیری انعطاف‌پذیر است. ما درک
            می‌کنیم که هر فردی با سرعت و زمان‌بندی مخصوص به خود یاد می‌گیرد و
            بنابراین دوره‌های ما به صورت آنلاین و قابل دسترسی در هر زمان و مکانی
            طراحی شده‌اند. شما می‌توانید با توجه به زمان و شرایط خود، دوره‌های
            مورد نظر خود را انتخاب کرده و به یادگیری بپردازید. این انعطاف‌پذیری
            به شما این امکان را می‌دهد که یادگیری خود را با زندگی روزمره‌تان
            هماهنگ کنید و بدون فشار و استرس، به پیشرفت در زمینه‌های مورد
            علاقه‌تان بپردازید.
          </Typography>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            جامعه یادگیری
          </Typography>
          <Typography sx={aboutusText}>
            یکی از مهم‌ترین مزایای یادگیری در کدینو، ارتباط با یک جامعه بزرگ و
            فعال از علاقه‌مندان به تکنولوژی است. ما در کدینو به ایجاد فضایی
            تعاملی و دوستانه اهمیت می‌دهیم که در آن دانشجویان می‌توانند با
            یکدیگر در ارتباط باشند، تجربیات خود را به اشتراک بگذارند و از
            حمایت‌های متقابل برخوردار شوند. این جامعه یادگیری باعث می‌شود که
            فرآیند یادگیری لذت‌ بخش‌ تر و اثربخش‌ تر باشد، زیرا شما می‌توانید از
            تجربیات دیگران استفاده کنید و در صورت نیاز به کمک، از حمایت‌های
            آن‌ها برخوردار شوید.
          </Typography>
          <Typography component="strong" sx={{ fontWeight: 600 }}>
            آینده برنامه نویسی با کدینو
          </Typography>
          <Typography sx={aboutusText}>
            در دنیایی که تکنولوژی به سرعت در حال پیشرفت است، یادگیری مداوم و
            ارتقای مهارت‌ها ضروری است. ما در آکادمی کدینو متعهد به ارائه بهترین
            و به‌روزترین منابع آموزشی هستیم تا شما بتوانید با اعتماد به نفس و
            دانش کافی، در هر مسیری که انتخاب می‌کنید، موفق باشید. آینده شما با
            یادگیری امروز شروع می‌شود و ما در کدینو آماده‌ایم تا در این مسیر
            همراه شما باشیم.
          </Typography>
        </Box>
        <Box
          sx={{
            width: {
              xs: "100%",
              lg: "33%",
              position: "sticky",
              top: "110px",
            },
            height: "100%",
          }}
        >
          <BlogSlider />
        </Box>
      </Box>
    </>
  );
}

export default Aboutus;
