import { focus_blog, kpi_blog, time_blog, unreal_blog } from "./imgSource";

export const blogData = [
  {
    id: 1,
    title:
      "آنریل انجین (Unreal Engine) چیست؟ معرفی کامل موتور بازی‌سازی اپیک گیمز و کاربردهای آن",
    text: " اگر دانشجوی کامپیوتر، گرافیک، معماری یا حتی سینما هستی، احتمالاً بارها اسم  آنریل انجین  به گوشت خورده است. در آگهی‌های شغلی، ویدیوهای پشت صحنه فیلم‌ها، نمایشگاه‌های بازی و حتی در رندرهای معماری، ...",
    slug: "/mag/post/what-is-unreal-engine",
    imgSrc: unreal_blog,
    created_at: "2026-06-19T10:30:00Z",
  },
  {
    id: 2,
    title: "شاخص کلیدی عملکرد (KPI) چیست؟ راهنمای کامل برای سنجش عملکرد",
    text: "  تصور کنید در حال هدایت یک هواپیمای مسافربری در تاریکی شب هستید، اما هیچ ابزاری برای بررسی سرعت، ارتفاع یا میزان سوخت ندارید. چقدر احتمال دارد سالم به مقصد برسید؟ مدیریت یک کسب‌وکار، تیم مارکتینگ ی...",
    slug: "/mag/post/what-is-kpi",
    imgSrc: kpi_blog,
    created_at: "2026-06-11T10:30:00Z",
  },
  {
    id: 3,
    title: "مدیریت زمان برای برنامه‌نویسان: ۱۲ تکنیک کاربردی برای افزایش",
    text: "برنامه‌نویسی فقط « کدنویسی » نیست؛ ترکیبی است از حل مسئله، مطالعه مستندات، دیباگ، جلسه، ارتباط با تیم، یادگیری مداوم و گاهی هم مقابله با ددلاین‌های فشرده. همین چندوجهی بودن باعث می‌شود  مدیریت زما...",
    slug: "/mag/post/time-management-for-programmers-12-techniques",
    imgSrc: time_blog,
    created_at: "2026-06-02T10:30:00Z",
  },
  {
    id: 4,
    title: " چگونه در شرایط سخت همچنان روی مسیرحرفه ای خود تمرکز کنیم؟",
    text: " برای خیلی از ما، اینترنت بین‌الملل تبدیل شده به ستون اصلی کار و رشد حرفه‌ای: یاد می‌گیریم، شبکه‌سازی می‌کنیم، پروژه می‌گیریم، رزومه می‌سازیم و حتی انگیزه‌مان را از تعامل‌های حرفه‌ای آنلاین می‌گیری...",
    slug: "/mag/post/stay-focused-on-your-career-during-international-internet-outage",
    imgSrc: focus_blog,
    created_at: "2026-05-30T10:30:00Z",
  },
];
