import { blog_1, blog_2, blog_3, blog_4, blog_5 } from "./imgSource";

export const blogSliderData = [
  {
    id: 1,
    title: "آموزش کامل ساخت ربات تلگرام با پایتون",
    description:
      "امروزه یکی از فعالیت‌های جذاب در دنیای برنامه‌نویسی به شمار می‌آید که دارای کاربردهای زیادی نیز می‌باشد",
    imgUrl: blog_1,
  },
  {
    id: 2,
    title: " معرفی 7 اپلیکیشن کدنویسی مخصوص موبایل",
    description:
      "امروزه یکی از فعالیت‌های جذاب در دنیای برنامه‌نویسی به شمار می‌آید که دارای کاربردهای زیادی نیز می‌باشد",
    imgUrl: blog_2,
  },
  {
    id: 3,
    title: "برنامه نویسی چیست؟ برنامه نویس دقیقا چه کاری انجام میدهد؟",
    description:
      '" در آینده ای نزدیک، برنامه نویسی حکم آموزش های اولیه همچون نوشتن و خواندن را برای کودکان پیدا خواهد کرد و نیاز به آن در همه زمینه ها احساس خواهد شد، به گونه ای که بزرگ‌ترها افسوس می خورند که چرا زودتر اقدام به آموزش آن نکرده اند."',
    imgUrl: blog_3,
  },
  {
    id: 4,
    title: "جاوا اسکریپت را چگونه فعال کنیم؟",
    description:
      "جاوا اسکریپت، نامی آشنا در بین تمام برنامه نویسان است! در واقع همانطور که می‌دانید یکی از زبان‌های محبوب برنامه نویسی در جهان است. JavaScript بر روی مرورگرهای کاربران اجرا می‌شود.",
    imgUrl: blog_4,
  },
  {
    id: 5,
    title: "یادگیری برنامه نویسی چقدر طول می کشد؟",
    description:
      "برنامه‌نویسی در واقع یک علم است که به کمک آن می‌توان به کامپیوتر دستوراتی برای اجرا داد. دستورات را در قالب یک سری کد به کامپیوتر می‌دهیم.",
    imgUrl: blog_5,
  },
];
