import teacherAvatar from "../assets/images/Mentors/mentor_1.webp";
import userAvatar_1 from "../assets/images/Users/user_1.webp";
import userAvatar_2 from "../assets/images/Users/user_2.webp";
import userAvatar_3 from "../assets/images/Users/user_3.webp";

export const courseCommentData = [
  {
    id: 1,
    name: "زهرا",
    created_at: "1405/03/31",
    avatar: "",
    content: `سلام استاد خوب هستین؟ممنون از زحماتتون🙏❤️.استاد من که میخوام تازه شروع به یادگیری ریکت کنم با دوره جدید پیش برم یا قدیمی؟چون ساعات تدریس دو دوره باهم متفاوته برام سوال شده`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1405/03/31",
      content: `سلام دوست من با همین دوره شروع کنید. در ادامه کامل متوجه میشید باید چکار کنید`,
    },
  },
  {
    id: 2,
    name: "بهروز یوسف زاده",
    created_at: "1405/03/19",
    avatar: userAvatar_1,
    content: `سلام وقت بخیر،پروژه های تمرینی زیاد زم ولی به جرات کامل ترین و جامع ترینشون پروژه پایانی دوره صفر تا صد ری اکت شما بود تشکر از آموزش عالی تون`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1405/03/19",
      content: `سلام دوست من 
      ممنونم از نظر دلگرم کنندتون❤️`,
    },
  },
  {
    id: 3,
    name: "پریسا شهبازی",
    created_at: "1405/03/09",
    avatar: userAvatar_2,
    content: `سلام وقت بخیر
    بسیار عالی تدریس می کنید . مفاهیمی که خیلی اوقات استفاده میکردم و علتشو نمیدونستم کاملا برام شفاف شد. ممنون از گفتن مطلب اصلی در زمان کوتاه مچکرم`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1405/03/15",
      content: `سلام و ارادت فراوان👋
      ممنون از نظر دلگرم کنندتون🙏
      و باعث افتخاره که براتون مفید بود`,
    },
  },
  {
    id: 4,
    name: "امیرمحمد ناظمی",
    created_at: "1405/02/31",
    avatar: "",
    content: `استاد سلام ایام به کام
    استاد فکر میکنم در بخش 7 مفاهیم پیشرفته در React تایتل جلسه اول اشتباه تایپی داره نوشته ContextA API
    گفتم اگه خواستید اصلاح کنید با تشکر.`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1405/02/31",
      content: `سلام عزیزم ممنون از تذکر بجا🙌`,
    },
  },
  {
    id: 5,
    name: "sadaf ahmadi",
    created_at: "1405/01/07",
    avatar: "",
    content: `سلام خسته نباشید ۲ فصل آخرش کی به سایت اضافه میشه و میشه دید؟`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1405/01/08",
      content: `سلام عزیزم. در قسمت آپلود شده در فصل state managements کامل توضیح دادم که در ادامه چکار کنید`,
    },
  },
  {
    id: 6,
    name: "محمدرضا محمدی",
    created_at: "1404/12/23",
    avatar: userAvatar_3,
    content: `سلام استاد بزرگوار آقای بساکی عزیز
    ممنون بابت پشتیبانی فوق العاده دوره‌هاتون
    با توجه به قطعی اینترنت و اینکه کسانی که توی این قطعی اینترنت دوره رو شروع کردن نمیتونن پروژه‌ای استارت بزنن(به علت عدم دسترسی به ریپازیتوری‌ها) ممنون میشم اگر دایرکتوری پروژه‌ها رو به دوره‌هاتون پیوست کنید`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1404/12/24",
      content: `سلام عزیزم به نکته مهمی اشاره کردید 
      ولی نکته اینجاست که سورس هم که بدم باز به npm برای نصب پکیج ها نیازه که بازم به مشکل میخوریم
      من خودم دنبال میرور هایی هستم که اگر جواب بدن حتما قرار میدم`,
    },
  },
  {
    id: 7,
    name: "mahdi khoobroyan",
    created_at: "1404/10/15",
    avatar: "",
    content: `سلام و دورد استاد اول ا ز همه خواستم ازتون بابت دوره خوبتون تشکر کنم تا به اینجا که عالی بوده دورتون ولی خواستم یه سوالی رو ازتون بپرسم من دوره فرانت اند رو خریدم ولی وقتی که به بخش react رسیدم ترجیحم بر این بود که دوره ریکت رو از همین دوره پیش ببرم چون به نظرم جامع تر هست خواستم بدونم همین دوره رو برم بهتره همون دوره فرانت اند ؟`,
    reply: {
      role: "teacher",
      name: "قاسم بساکی",
      avatar: teacherAvatar,
      created_at: "1404/10/30",
      content: `سلام عزیزم خوب این دوره دقیقا همون بخش ریکت متخصص فرانت اند هست فقط با کمی تغییر کوچیک.
      فرقی نمیکنه از هرکدوم راحتید استفاده کنید`,
    },
  },
];
