export const courseContentData = [
  {
    title: "پروژه‌محور بودن : ",
    description:
      "در طول دوره همیشه با مثال‌ها و پروژه‌های عملی پیش می‌رویم. یادگیری صرفاً تئوری نیست و شما در هر بخش یک خروجی واقعی خواهید داشت.",
  },
  {
    title: "بازار کار محور : ",
    description:
      "در پایان دوره یک پروژه واقعی نزدیک به نیازهای بازار کار پیاده‌سازی می‌کنیم؛ پروژه‌ای که شامل وب‌سرویس اختصاصی و ساختار تیمی است تا تجربه کار واقعی در یک تیم توسعه نرم‌افزار را بدست آورید.",
  },
  {
    title: "ساده‌سازی مباحث سنگین : ",
    description:
      "مباحثی مثل Redux که معمولاً باعث نگرانی دانشجوها می‌شود، به ساده‌ترین شکل ممکن توضیح داده شده تا هر کسی بتواند بدون سختی آن را یاد بگیرد.",
  },
  {
    title: "آپدیت جدید و استفاده از AI : ",
    description:
      " این دوره بر اساس آخرین تغییرات React 18 و نسخه‌های جدید آن ضبط شده و علاوه بر آن، کاربرد هوش مصنوعی (AI) در توسعه و یادگیری React نیز آموزش داده می‌شود.",
  },
  {
    title: "زمان کم، یادگیری بیشتر : ",
    description:
      " برای هر دقیقه آموزش حدود ۲۰ دقیقه زمان صرف شده تا مطالب به ساده‌ترین و مفیدترین شکل منتقل شود. در نتیجه شما می‌توانید در کمترین زمان ممکن، بیشترین نتیجه را بگیرید.",
  },
];
