export const courseFaqData = [
  {
    id: 1,
    q: "ری اکت چیست؟",
    a: "React یک کتابخانه‌ی جاوا اسکریپتی است که برای ساخت یوزر اینترفیس یا همان رابط کاربری مورد استفاده قرار می‌گیرد",
  },
  {
    id: 2,
    q: "چرا یادگیری ری اکت ساده است ؟",
    a: "چرا که ما فقط قرار است از سینتکس خود از جاوا اسکریپت استفاده کنیم. اگر تا حدودی با جاوا اسکریپت آشنا باشیم می‌توانیم به راحتی از آن استفاده کنیم. یکی از مزایای دیگر این نوع کتابخانه کامپوننت  محور بودن آن  می‌باشد. ",
  },
  {
    id: 3,
    q: "برای یادگیری ری اکت چه پیش‌ نیازهایی لازم است؟",
    a: "مبانی جاوا اسکریپت, برنامه‌نویسی شیء گرا, آشنایی با الگوریتم‌ها, آشنایی با Flex",
  },
  {
    id: 4,
    q: "چه کسانی باید ری اکت رو یاد بگیرند؟",
    a: "React یک تکنولوژی سمت کاربر میباشد و اصولا هر کسی که وارد دنیای برنامه نویسی وب میشه باید با فرانت‌اند آشنا باشه ولی معمولا کسایی که میخوان توی بحث فرانت‌اند قوی شوند و پروژه های حرفه‌ای بزنند، سراغ تکنولوژی های سمت کاربر جاوااسکریپت مثلا React می‌آیند.",
  },
  {
    id: 5,
    q: "رقبای اصلی React چه تکنولوژی هایی میباشد؟",
    a: "React در میان تمامی تکنولوژی‌های جاوااسکریپتی که عملیات آنی (Real Time) را برای ما انجام می‌دهند و همچنین می‌توانند خروجی SPA (وب‌اپلیکیشن‌های تک‌صفحه‌ای) داشته باشند، قرار می‌گیرد که قوی‌ترین و محبوب‌ترین آن‌ها، React، Angular و Vue هستند. باید گفت React برخلاف آن دو که فریم‌ورک هستند، یک کتابخانه است.\nرقبای اصلی React عبارتند از:\nAngular - یک فریم‌ورک جاوااسکریپت قدرتمند از طرف Google\nVue - یک فریم‌ورک جاوااسکریپت سبک‌وزن و انعطاف‌پذیر",
  },
  {
    id: 6,
    q: "برای بک اند  بهتره چه چیزی یاد بگیرم؟",
    a: "در پروژه‌های React، برای انجام عملیات و برقراری ارتباط با سمت سرور، نیاز به وب‌سرویس‌هایی داریم که توسط بک‌اند ایجاد می‌شود. به لطف RESTful API اصلاً فرقی نمی‌کند که در سمت سرور از چه تکنولوژی‌ای استفاده کنید.اگر علاقه‌مندید توانایی‌های خود را در زمینه بک‌اند هم افزایش دهید، پیشنهاد می‌کنم به ترتیب از محبوب‌ترین تکنولوژی‌ها مانند Node.js، PHP، Python و Ruby on Rails شروع کنید.",
  },
  {
    id: 7,
    q: "بازار کار ری اکت چطور است؟",
    a: "بهتر است این سؤال را به صورت کلی پاسخ دهم. دوست عزیز، اگر شما بتوانید در هر تکنولوژی برنامه‌نویسی، تبدیل به یک متخصص شوید و توانایی انجام پروژه داشته باشید، تقریباً می‌توان گفت که شما می‌توانید به راحتی شغل مرتبط با تخصص خود را پیدا کنید. اکثر آگهی‌های استخدام متخصص فرانت‌اند در سراسر دنیا، تسلط به React از آیتم‌های مهم به‌شمار می‌آید. شما در صورت تسلط به این تکنولوژی، می‌توانید رزومه خود را برای بسیاری از این آگهی‌ها ارسال کنید و در نهایت مشغول به کار شوید.",
  },
];
