export const faqData = [
  {
    id: 1,
    q: "کدینو چیست و چه خدماتی ارائه می‌دهد؟",
    a: "کدینو یک پلتفرم آموزشی آنلاین است که با هدف آموزش برنامه‌نویسی و مهارت‌های مرتبط با تکنولوژی راه‌اندازی شده است. ما دوره‌های آموزشی رایگان و غیررایگان در زمینه‌های مختلف مانند طراحی وب، برنامه‌نویسی، هوش مصنوعی، امنیت، دیتابیس، بازاریابی، مهارت‌های نرم و ... ارائه می‌دهیم.",
  },
  {
    id: 2,
    q: "آیا برای استفاده از دوره‌ها باید هزینه پرداخت کنم؟",
    a: "بسیاری از دوره‌های آموزشی کدینو رایگان هستند، اما برخی دوره‌های تخصصی‌تر و پیشرفته به‌صورت غیررایگان ارائه می‌شوند. اطلاعات کامل درباره هزینه هر دوره در صفحه‌ی مربوط به آن قابل مشاهده است.",
  },
  {
    id: 3,
    q: "چگونه می‌توانم در کدینو ثبت‌نام کنم؟",
    a: 'برای ثبت‌نام کافی است از طریق دکمه‌ی "ورود / ثبت‌نام" در بالای سایت، با وارد کردن ایمیل و رمز عبور یا از طریق حساب گوگل وارد شوید.',
  },
  {
    id: 4,
    q: "آیا به مدرک پایان دوره دسترسی خواهم داشت؟",
    a: "بله، پس از تکمیل دوره‌های آموزشی، در صورت گذراندن آزمون‌ها و تکالیف مورد نیاز، گواهی پایان دوره به صورت دیجیتال صادر می‌شود.",
  },
  {
    id: 5,
    q: "سطح دوره‌های کدینو برای چه کسانی مناسب است؟",
    a: "دوره‌های کدینو برای همه‌ی سطوح طراحی شده‌اند؛ چه مبتدی باشید و چه حرفه‌ای. می‌توانید با دوره‌های پایه‌ای شروع کرده و به مرور سراغ دوره‌های تخصصی‌تر بروید.",
  },
  {
    id: 6,
    q: "آیا می‌توانم سوالاتم را از مدرسین بپرسم؟",
    a: "بله، در اکثر دوره‌ها بخشی برای پرسش و پاسخ و همچنین گروه تلگرام پرسش و پاسخ در نظر گرفته شده است که می‌توانید سوالات خود را مطرح کرده و از مدرس یا سایر دانشجویان پاسخ بگیرید.",
  },
  {
    id: 7,
    q: "چطور می‌توانم مدرس کدینو شوم؟",
    a: "اگر در حوزه‌ای از برنامه‌نویسی یا فناوری مهارت دارید و علاقه‌مند به تدریس هستید، می‌توانید از طریق فرم همکاری با ما، درخواست خود را ثبت کنید. تیم کدینو با شما تماس خواهد گرفت.",
  },
  {
    id: 8,
    q: "آیا امکان دانلود و مشاهده آفلاین ویدیوها وجود دارد؟",
    a: "در حال حاضر مشاهده‌ی ویدیوها به‌صورت آنلاین از طریق پلتفرم کدینو امکان‌پذیر است. همچنین ویدیو و یا پیوست جلسات آموزشی را به صورت تکی میتوانید دانلود کنید.",
  },
];
