export const mentorData = [
  {
    text: "تو دنیای برنامه‌نویسی فقط کافیه شروع کنی، مسیرتو با علاقه و هدف انتخاب کنی و حرفه‌ای پیش بری؛ یادت نره تغییر مسیر اینجا سخت نیست، مهم اینه که شروع کنی و با تمرکز ادامه بدی",
    mentorName: "قاسم بساکی",
  },
  {
    text: "مسیر یادگیری برنامه نویسی پر از چالشه، ولی خبر خوب اینه که ما این مسیرو رفتیم و اینجاییم که کنارت باشیم، ما همیشه در دسترسیم، انواع راه های ارتباطی ام باز گذاشتیم، فقط کافیه بهمون پیام بدی و هر چالش و سوالی داری مطرح کنی",
    mentorName: "محمد هاشمی",
  },
  {
    text: "برنامه نویسی مثل یادگرفتن یه زبان جدیده؛ اولش سخت به نظر میاد، ولی کم کم کدها برات حرف میزنن. مهم نیست از کجا شروع می کنی، مهم اینه که متوقف نشی.\nما اینجاییم تا هرجا گیر کردی، همراهت باشیم.\nاز امروز بنویس؛ حتی اگه فقط یه خط باشه.",
    mentorName: "امیرحسین امیری",
  },
  // {
  //   text: "برنامه‌نویسی را با درک مفاهیم پایه شروع کنید، نه حفظ کردن کد. یادگیری اصول مثل تفکر الگوریتمی، صبر و تمرین مستمر، کلید پیشرفت واقعی است",
  //   mentorName: "میلاد ده یامی",
  // },
];
